Tekla.Structures.DialogInternal.Remoter
Handles the .net remoting for dialog-assembly.

Tekla.Structures.DialogInternal.Remoter.ChannelName
Name of the remoting channel to register.

Tekla.Structures.DialogInternal.Remoter.PublishTypes
Publishes the .net remoting types.

Tekla.Structures.DialogInternal.Remoter.InitializeSandBox
Initializes the .net remoting channel
Returns: